RhinoInside.Revit API Documentation
GeometryEncoder.ToCurve Method (Curve)
 Converts the specified Rhino.Geometry.Curve to an equivalent of Autodesk.Revit.DB.Curve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Autodesk.Revit.DB.Curve ToCurve(
	this Rhino.Geometry.Curve curve
)
@staticmethod
def ToCurve(
	curve: Rhino.Geometry.Curve
) -> Autodesk.Revit.DB.Curve
Parameters
curve
Type: Rhino.Geometry.Curve
Rhino curve to convert.
Return Value
Type: Autodesk.Revit.DB.Curve
Revit curve that is equivalent to the provided Rhino curve.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Curve. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToCurve(Curve) as extension method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.Curve revitCurve = rhinoCurve.ToCurve();
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry
6clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
7
8revit_curve: DB.Curve = rhino_curve.ToCurve()
 Using ToCurve(Curve) as static method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.Curve revitCurve = GeometryEncoder.ToCurve(rhinoCurve);
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as ge
6
7revit_curve: DB.Curve = ge.ToCurve(rhino_curve)
See Also
Reference
GeometryEncoder Class
ToCurve Overload
RhinoInside.Revit.Convert.Geometry Namespace